## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.prod will be created
  + resource "azurerm_kubernetes_cluster" "prod" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "fp11-aks-prod-dns"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.32.0"
      + location                            = "canadacentral"
      + name                                = "fp11-aks-prod"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "cst8918-final-project-group-11"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "environment" = "prod"
        }
      + workload_identity_enabled           = false

      + api_server_access_profile (known after apply)

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + enable_auto_scaling  = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 3
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "default"
          + node_count           = (known after apply)
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s"
          + vnet_subnet_id       = (known after apply)
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + network_profile (known after apply)

      + windows_profile (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster.test will be created
  + resource "azurerm_kubernetes_cluster" "test" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "fp11-aks-test-dns"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.32.0"
      + location                            = "canadacentral"
      + name                                = "fp11-aks-test"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "cst8918-final-project-group-11"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "environment" = "test"
        }
      + workload_identity_enabled           = false

      + api_server_access_profile (known after apply)

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s"
          + vnet_subnet_id       = (known after apply)
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + network_profile (known after apply)

      + windows_profile (known after apply)
    }

  # module.network.azurerm_resource_group.network_rg will be created
  + resource "azurerm_resource_group" "network_rg" {
      + id       = (known after apply)
      + location = "canadacentral"
      + name     = "cst8918-final-project-group-11"
    }

  # module.network.azurerm_subnet.admin will be created
  + resource "azurerm_subnet" "admin" {
      + address_prefixes                               = [
          + "10.3.0.0/16",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "admin"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cst8918-final-project-group-11"
      + virtual_network_name                           = "fp11-vnet"
    }

  # module.network.azurerm_subnet.dev will be created
  + resource "azurerm_subnet" "dev" {
      + address_prefixes                               = [
          + "10.2.0.0/16",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dev"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cst8918-final-project-group-11"
      + virtual_network_name                           = "fp11-vnet"
    }

  # module.network.azurerm_subnet.prod will be created
  + resource "azurerm_subnet" "prod" {
      + address_prefixes                               = [
          + "10.0.0.0/16",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "prod"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cst8918-final-project-group-11"
      + virtual_network_name                           = "fp11-vnet"
    }

  # module.network.azurerm_subnet.test will be created
  + resource "azurerm_subnet" "test" {
      + address_prefixes                               = [
          + "10.1.0.0/16",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "test"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cst8918-final-project-group-11"
      + virtual_network_name                           = "fp11-vnet"
    }

  # module.network.azurerm_virtual_network.main_vnet will be created
  + resource "azurerm_virtual_network" "main_vnet" {
      + address_space       = [
          + "10.0.0.0/14",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "canadacentral"
      + name                = "fp11-vnet"
      + resource_group_name = "cst8918-final-project-group-11"
      + subnet              = (known after apply)
    }

  # module.networking.azurerm_resource_group.network_rg will be destroyed
  # (because azurerm_resource_group.network_rg is not in configuration)
  - resource "azurerm_resource_group" "network_rg" {
      - id         = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/cst8918-final-project-group-11" -> null
      - location   = "canadacentral" -> null
      - name       = "cst8918-final-project-group-11" -> null
        # (1 unchanged attribute hidden)
    }

  # module.networking.azurerm_subnet.admin will be destroyed
  # (because azurerm_subnet.admin is not in configuration)
  - resource "azurerm_subnet" "admin" {
      - address_prefixes                               = [
          - "10.3.0.0/16",
        ] -> null
      - default_outbound_access_enabled                = true -> null
      - enforce_private_link_endpoint_network_policies = false -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/cst8918-final-project-group-11/providers/Microsoft.Network/virtualNetworks/fp11-vnet/subnets/admin" -> null
      - name                                           = "admin" -> null
      - private_endpoint_network_policies              = "Enabled" -> null
      - private_endpoint_network_policies_enabled      = true -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "cst8918-final-project-group-11" -> null
      - virtual_network_name                           = "fp11-vnet" -> null
    }

  # module.networking.azurerm_subnet.dev will be destroyed
  # (because azurerm_subnet.dev is not in configuration)
  - resource "azurerm_subnet" "dev" {
      - address_prefixes                               = [
          - "10.2.0.0/16",
        ] -> null
      - default_outbound_access_enabled                = true -> null
      - enforce_private_link_endpoint_network_policies = false -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/cst8918-final-project-group-11/providers/Microsoft.Network/virtualNetworks/fp11-vnet/subnets/dev" -> null
      - name                                           = "dev" -> null
      - private_endpoint_network_policies              = "Enabled" -> null
      - private_endpoint_network_policies_enabled      = true -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "cst8918-final-project-group-11" -> null
      - virtual_network_name                           = "fp11-vnet" -> null
    }

  # module.networking.azurerm_subnet.prod will be destroyed
  # (because azurerm_subnet.prod is not in configuration)
  - resource "azurerm_subnet" "prod" {
      - address_prefixes                               = [
          - "10.0.0.0/16",
        ] -> null
      - default_outbound_access_enabled                = true -> null
      - enforce_private_link_endpoint_network_policies = false -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/cst8918-final-project-group-11/providers/Microsoft.Network/virtualNetworks/fp11-vnet/subnets/prod" -> null
      - name                                           = "prod" -> null
      - private_endpoint_network_policies              = "Enabled" -> null
      - private_endpoint_network_policies_enabled      = true -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "cst8918-final-project-group-11" -> null
      - virtual_network_name                           = "fp11-vnet" -> null
    }

  # module.networking.azurerm_subnet.test will be destroyed
  # (because azurerm_subnet.test is not in configuration)
  - resource "azurerm_subnet" "test" {
      - address_prefixes                               = [
          - "10.1.0.0/16",
        ] -> null
      - default_outbound_access_enabled                = true -> null
      - enforce_private_link_endpoint_network_policies = false -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/cst8918-final-project-group-11/providers/Microsoft.Network/virtualNetworks/fp11-vnet/subnets/test" -> null
      - name                                           = "test" -> null
      - private_endpoint_network_policies              = "Enabled" -> null
      - private_endpoint_network_policies_enabled      = true -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "cst8918-final-project-group-11" -> null
      - virtual_network_name                           = "fp11-vnet" -> null
    }

  # module.networking.azurerm_virtual_network.main_vnet will be destroyed
  # (because azurerm_virtual_network.main_vnet is not in configuration)
  - resource "azurerm_virtual_network" "main_vnet" {
      - address_space           = [
          - "10.0.0.0/14",
        ] -> null
      - dns_servers             = [] -> null
      - flow_timeout_in_minutes = 0 -> null
      - guid                    = "c437705e-979f-4656-a24a-22595c6a44a0" -> null
      - id                      = "/subscriptions/56d67ba7-7129-4796-810e-a6159bb4b456/resourceGroups/cst8918-final-project-group-11/providers/Microsoft.Network/virtualNetworks/fp11-vnet" -> null
      - location                = "canadacentral" -> null
      - name                    = "fp11-vnet" -> null
      - resource_group_name     = "cst8918-final-project-group-11" -> null
      - subnet                  = [] -> null
        # (2 unchanged attributes hidden)
    }

Plan: 8 to add, 0 to change, 6 to destroy.
```
</details>